// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, 
//какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// Console.Write("Введите целое число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе целое число: ");
// int b = Convert.ToInt32(Console.ReadLine());
// if(a > b)
// {
//     Console.WriteLine("Максисальное число: " + a);
// }
// else
// {
//     Console.WriteLine("Максисальное число: " + b);
// }

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Console.Write("Введите первое целое число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("введите второе целое число: ");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.Write("введите третье целое число: ");
// int c = Convert.ToInt32(Console.ReadLine());

// if(a > b)
// {
//     if(a > c)
//     {
//         Console.WriteLine("максимальное число: " + a);
//     }
// }

// if(b > a)
// {
//     if(b > c)
//     {
//         Console.WriteLine("максимальное число: " + b);
//     }
//     }

// if(c > b)
// {
//     if(a < c)
//     {
//         Console.WriteLine("максимальное число: " + c);
//     }
// }


// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
//является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет



// Задача 8: Напишите программу, которая на вход принимает число (N), 
//а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4

